In [1]:
import pandas as pd
import mysql.connector as mysql

In [2]:
connect = mysql.connect(host = "localhost",database = "dsc", user="admin", password = "admin")

In [3]:
cursor = connect.cursor()
cursor.execute("SELECT * FROM offices")

tabel_office = cursor.fetchall()
tabel_office

[('1',
  'San Francisco',
  '+1 650 219 4782',
  '100 Market Street',
  'Suite 300',
  'CA',
  'USA',
  '94080',
  'NA'),
 ('2',
  'Boston',
  '+1 215 837 0825',
  '1550 Court Place',
  'Suite 102',
  'MA',
  'USA',
  '02107',
  'NA'),
 ('3',
  'NYC',
  '+1 212 555 3000',
  '523 East 53rd Street',
  'apt. 5A',
  'NY',
  'USA',
  '10022',
  'NA'),
 ('4',
  'Paris',
  '+33 14 723 4404',
  "43 Rue Jouffroy D'abbans",
  None,
  None,
  'France',
  '75017',
  'EMEA'),
 ('5',
  'Tokyo',
  '+81 33 224 5000',
  '4-1 Kioicho',
  None,
  'Chiyoda-Ku',
  'Japan',
  '102-8578',
  'Japan'),
 ('6',
  'Sydney',
  '+61 2 9264 2451',
  '5-11 Wentworth Avenue',
  'Floor #2',
  None,
  'Australia',
  'NSW 2010',
  'APAC'),
 ('7',
  'Amsterdam',
  '+44 20 7877 2041',
  '25 Old Broad Street',
  'Level 7',
  None,
  'UK',
  'EC2N 1HN',
  'EMEA')]

In [4]:
query = "INSERT INTO offices VALUES ('9','Jakarta','+62 8155 431 8322','Jln Merdeka Barat','Jln Sudirman','JKT','IDN','61374','Indonesia')"
cursor.execute(query)
connect.commit()

In [5]:
cursor.execute("SELECT * FROM offices")
tabel_office = cursor.fetchall()
tabel_office

[('1',
  'San Francisco',
  '+1 650 219 4782',
  '100 Market Street',
  'Suite 300',
  'CA',
  'USA',
  '94080',
  'NA'),
 ('2',
  'Boston',
  '+1 215 837 0825',
  '1550 Court Place',
  'Suite 102',
  'MA',
  'USA',
  '02107',
  'NA'),
 ('3',
  'NYC',
  '+1 212 555 3000',
  '523 East 53rd Street',
  'apt. 5A',
  'NY',
  'USA',
  '10022',
  'NA'),
 ('4',
  'Paris',
  '+33 14 723 4404',
  "43 Rue Jouffroy D'abbans",
  None,
  None,
  'France',
  '75017',
  'EMEA'),
 ('5',
  'Tokyo',
  '+81 33 224 5000',
  '4-1 Kioicho',
  None,
  'Chiyoda-Ku',
  'Japan',
  '102-8578',
  'Japan'),
 ('6',
  'Sydney',
  '+61 2 9264 2451',
  '5-11 Wentworth Avenue',
  'Floor #2',
  None,
  'Australia',
  'NSW 2010',
  'APAC'),
 ('7',
  'Amsterdam',
  '+44 20 7877 2041',
  '25 Old Broad Street',
  'Level 7',
  None,
  'UK',
  'EC2N 1HN',
  'EMEA'),
 ('9',
  'Jakarta',
  '+62 8155 431 8322',
  'Jln Merdeka Barat',
  'Jln Sudirman',
  'JKT',
  'IDN',
  '61374',
  'Indonesia')]

In [6]:
query = "UPDATE offices SET city = 'Amsterdam' WHERE officeCode = 7"
cursor.execute(query)
connect.commit()

In [7]:
cursor.execute("SELECT * FROM offices")
tabel_office = cursor.fetchall()
tabel_office

[('1',
  'San Francisco',
  '+1 650 219 4782',
  '100 Market Street',
  'Suite 300',
  'CA',
  'USA',
  '94080',
  'NA'),
 ('2',
  'Boston',
  '+1 215 837 0825',
  '1550 Court Place',
  'Suite 102',
  'MA',
  'USA',
  '02107',
  'NA'),
 ('3',
  'NYC',
  '+1 212 555 3000',
  '523 East 53rd Street',
  'apt. 5A',
  'NY',
  'USA',
  '10022',
  'NA'),
 ('4',
  'Paris',
  '+33 14 723 4404',
  "43 Rue Jouffroy D'abbans",
  None,
  None,
  'France',
  '75017',
  'EMEA'),
 ('5',
  'Tokyo',
  '+81 33 224 5000',
  '4-1 Kioicho',
  None,
  'Chiyoda-Ku',
  'Japan',
  '102-8578',
  'Japan'),
 ('6',
  'Sydney',
  '+61 2 9264 2451',
  '5-11 Wentworth Avenue',
  'Floor #2',
  None,
  'Australia',
  'NSW 2010',
  'APAC'),
 ('7',
  'Amsterdam',
  '+44 20 7877 2041',
  '25 Old Broad Street',
  'Level 7',
  None,
  'UK',
  'EC2N 1HN',
  'EMEA'),
 ('9',
  'Jakarta',
  '+62 8155 431 8322',
  'Jln Merdeka Barat',
  'Jln Sudirman',
  'JKT',
  'IDN',
  '61374',
  'Indonesia')]

In [8]:
query = "DELETE FROM offices WHERE officeCode = 9"
cursor.execute(query)
connect.commit()

In [9]:
data_office = pd.DataFrame(columns = ["Office Code","City","Phone",
                                      "Address 1","Address 2","State","Country","Postal Code","Teritory"],
                           data = tabel_office)
data_office

,Office Code,City,Phone,Address 1,Address 2,State,Country,Postal Code,Teritory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,None,None,France,75017,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,None,Chiyoda-Ku,Japan,102-8578,Japan
5,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,None,Australia,NSW 2010,APAC
6,7,Amsterdam,+44 20 7877 2041,25 Old Broad Street,Level 7,None,UK,EC2N 1HN,EMEA
7,9,Jakarta,+62 8155 431 8322,Jln Merdeka Barat,Jln Sudirman,JKT,IDN,61374,Indonesia

In [10]:
data_office.shape

(8, 9)

In [11]:
data_office.describe()

,Office Code,City,Phone,Address 1,Address 2,State,Country,Postal Code,Teritory
count,8,8,8,8,6,5,8,8,8
unique,8,8,8,8,6,5,6,8,5
top,3,Tokyo,+1 215 837 0825,523 East 53rd Street,Jln Sudirman,NY,USA,10022,NA
freq,1,1,1,1,1,1,3,1,3

In [12]:
data_office['State'].value_counts()

NY            1
JKT           1
CA            1
Chiyoda-Ku    1
MA            1
Name: State, dtype: int64

In [13]:
data_office.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Office Code  8 non-null      object
 1   City         8 non-null      object
 2   Phone        8 non-null      object
 3   Address 1    8 non-null      object
 4   Address 2    6 non-null      object
 5   State        5 non-null      object
 6   Country      8 non-null      object
 7   Postal Code  8 non-null      object
 8   Teritory     8 non-null      object
dtypes: object(9)
memory usage: 704.0+ bytes

In [14]:
import numpy as np

In [15]:
np.sum(data_office.isnull())

Office Code    0
City           0
Phone          0
Address 1      0
Address 2      2
State          3
Country        0
Postal Code    0
Teritory       0
dtype: int64

In [16]:
from sklearn.impute import SimpleImputer
from scipy.stats import mode

In [17]:
data_office['State'].mode()

0            CA
1    Chiyoda-Ku
2           JKT
3            MA
4            NY
dtype: object

In [18]:
data_office['Address 2'].mode()

0        Floor #2
1    Jln Sudirman
2         Level 7
3       Suite 102
4       Suite 300
5         apt. 5A
dtype: object

In [19]:
data_office['State']= data_office['State'].fillna(data_office['State'].mode()[0])
data_office['Address 2']= data_office['Address 2'].fillna(data_office['Address 2'].mode()[0])

In [20]:
data_office

,Office Code,City,Phone,Address 1,Address 2,State,Country,Postal Code,Teritory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,Floor #2,CA,France,75017,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,Floor #2,Chiyoda-Ku,Japan,102-8578,Japan
5,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,CA,Australia,NSW 2010,APAC
6,7,Amsterdam,+44 20 7877 2041,25 Old Broad Street,Level 7,CA,UK,EC2N 1HN,EMEA
7,9,Jakarta,+62 8155 431 8322,Jln Merdeka Barat,Jln Sudirman,JKT,IDN,61374,Indonesia

In [21]:
data_office['Postal Code'].describe()

count         8
unique        8
top       10022
freq          1
Name: Postal Code, dtype: object

In [22]:
from sklearn import preprocessing

In [23]:
kategori = ["Country","Teritory"]

In [24]:
le = preprocessing.LabelEncoder()

In [25]:
data_office.columns.values

array(['Office Code', 'City', 'Phone', 'Address 1', 'Address 2', 'State',
       'Country', 'Postal Code', 'Teritory'], dtype=object)

In [26]:
for i in kategori:
    if i in data_office.columns.values:
        data_office[i] = le.fit_transform(data_office[i])

In [27]:
data_office.head()

,Office Code,City,Phone,Address 1,Address 2,State,Country,Postal Code,Teritory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,5,94080,4
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,5,02107,4
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,5,10022,4
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,Floor #2,CA,1,75017,1
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,Floor #2,Chiyoda-Ku,3,102-8578,3

In [28]:
from sklearn.preprocessing import StandardScaler
from sklearn.decomposition import PCA
from sklearn import decomposition

In [29]:
bmsx = np.array([data_office["Country"],
                data_office["Teritory"]])
bmsx.shape

(2, 8)

In [30]:
bmsx

array([[5, 5, 5, 1, 3, 0, 4, 2],
       [4, 4, 4, 1, 3, 0, 1, 2]])

In [31]:
bms_std=StandardScaler().fit_transform(bmsx)
bms_std

array([[ 1.,  1.,  1.,  0.,  0.,  0.,  1.,  0.],
       [-1., -1., -1.,  0.,  0.,  0., -1.,  0.]])

In [32]:
pcafs=PCA(n_components=0.7,whiten=True)
bmsfs_pca=pcafs.fit_transform(bms_std)

In [33]:
print('Original number of features:', bms_std.shape[1])
print('Reduced numer of features:', bmsfs_pca.shape[1])

Original number of features: 8
Reduced numer of features: 1

In [34]:
datafe_pca=pd.DataFrame(bmsfs_pca, columns=["PC1"])
datafe_pca

        PC1
0  0.707107
1 -0.707107

In [35]:
sql = "CREATE TABLE hasil (id Integer AUTO_INCREMENT PRIMARY KEY, PC1 varchar(30))"
cursor.execute(sql)
connect.commit()

In [46]:
sql = "INSERT INTO hasil (PC1) VALUES (%s) "
val = ("John",)
cursor.execute(sql,val)

# print(i,"Telah Ditambahkan")
connect.commit()

In [54]:
cursor = connect.cursor()
for i in bmsfs_pca:
    sql = "INSERT INTO hasil (PC1) VALUES (%s)"
    val = (float(i[0]),)
    cursor.execute(sql,val)
    
    print(i,"Telah Ditambahkan")
    connect.commit()

[0.70710678] Telah Ditambahkan
[-0.70710678] Telah Ditambahkan

In [61]:
from pandas import DataFrame, read_csv

data = DataFrame({'Office': data_office['Office Code'],
                  'City': data_office['City'],
                  'Phone': data_office['Phone'],
                  'Address 1': data_office['Address 1'],
                  'Address 2': data_office['Address 2'],
                  'State': data_office['State'],
                  'Country': data_office['Country'],
                  'Postal Code': data_office['Postal Code'],
                  'Teritory': data_office['Teritory'],
                 })
data

,Office,City,Phone,Address 1,Address 2,State,Country,Postal Code,Teritory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,5,94080,4
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,5,02107,4
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,5,10022,4
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,Floor #2,CA,1,75017,1
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,Floor #2,Chiyoda-Ku,3,102-8578,3
5,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,CA,0,NSW 2010,0
6,7,Amsterdam,+44 20 7877 2041,25 Old Broad Street,Level 7,CA,4,EC2N 1HN,1
7,9,Jakarta,+62 8155 431 8322,Jln Merdeka Barat,Jln Sudirman,JKT,2,61374,2

In [62]:
data.to_csv("hasil_ekspor.csv", index=False)

In [64]:
data_ekspor = read_csv("hasil_ekspor.csv")
data_ekspor

,Office,City,Phone,Address 1,Address 2,State,Country,Postal Code,Teritory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,5,94080,4
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,5,02107,4
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,5,10022,4
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,Floor #2,CA,1,75017,1
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,Floor #2,Chiyoda-Ku,3,102-8578,3
5,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,CA,0,NSW 2010,0
6,7,Amsterdam,+44 20 7877 2041,25 Old Broad Street,Level 7,CA,4,EC2N 1HN,1
7,9,Jakarta,+62 8155 431 8322,Jln Merdeka Barat,Jln Sudirman,JKT,2,61374,2